tap "1password/tap"
tap "domt4/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "morantron/tmux-fingers"
brew "ack"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "bash"
brew "bat"
brew "chezmoi"
brew "python@3.12"
brew "difftastic"
brew "docker-compose"
brew "fpp"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "grpcurl"
brew "jq"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "ncdu"
brew "node"
brew "nvm"
brew "pyenv"
brew "pyenv-virtualenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "terminal-notifier"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"
brew "wget"
brew "xpdf"
brew "zsh"
brew "morantron/tmux-fingers/tmux-fingers"
cask "1password-cli"
cask "bartender"
cask "caffeine"
cask "diffmerge"
cask "doll"
cask "firefox"
cask "flycut"
cask "font-clear-sans"
cask "font-droid-sans-mono-for-powerline"
cask "font-roboto"
cask "font-roboto-mono-for-powerline"
cask "gray"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "obsidian"
cask "postman"
cask "shottr"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "todoist"
cask "xmind"
mas "MeetingBar", id: 1532419400
mas "Tomato One", id: 907364780
