tap "homebrew/cask-fonts"

brew "gnu-indent"
brew "gnu-which"
brew "autoconf"
brew "fpp"
brew "jq"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "rename"
brew "tree"
brew "vim"
brew "derailed/k9s/k9s"

# Search tool like grep, but optimized for programmers
brew "ack"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Get/set bluetooth power and discoverable state
# brew "blueutil"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU grep, egrep and fgrep
brew "grep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# UNIX shell (command interpreter)
brew "zsh"

# Command-line helper for the 1Password password manager
cask "1password-cli"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"

cask "caffeine"
cask "insync"
cask "slate"
cask "bartender"
cask "flycut"
cask "diffmerge"
cask "notion"
cask "omniplan"
cask "stay"
cask "alacritty"
cask "firefox"
cask "zoom"
cask "xmind"
cask "todoist"

cask "font-roboto"
cask "font-clear-sans"
cask "font-roboto-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
