tap "1password/tap"
tap "domt4/autoupdate"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "morantron/tmux-fingers"
brew "ack"
brew "tree"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "chezmoi"
brew "colima", restart_service: :changed
brew "coreutils"
brew "difftastic"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fpp"
brew "fswatch"
brew "fx"
brew "fzf"
brew "gawk"
brew "node"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "libevent"
brew "go"
brew "grep"
brew "grpcurl"
brew "htmlq"
brew "jq"
brew "k9s"
brew "kanata"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "ncdu"
brew "nvm"
brew "openvpn"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.12"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "speedtest-cli"
brew "starship"
brew "terminal-notifier"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "util-linux"
brew "vim"
brew "virtualenv"
brew "watch"
brew "wget"
brew "xpdf"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "morantron/tmux-fingers/tmux-fingers"
cask "1password"
cask "1password-cli"
cask "antigravity"
cask "appcleaner"
cask "caffeine"
cask "diffmerge"
cask "doll"
cask "firefox"
cask "flycut"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-code-nerd-font"
cask "font-noto-mono"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
cask "font-roboto-serif"
cask "gray"
cask "insync"
cask "iterm2"
cask "jordanbaird-ice@beta"
cask "karabiner-elements"
cask "kitty"
cask "lunar"
cask "noxappplayer"
cask "obsidian"
cask "postman"
cask "protonvpn"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stay"
cask "sublime-text"
cask "todoist-app"
cask "visual-studio-code"
cask "xmind"
mas "Clocker", id: 1056643111
mas "Hidden Bar", id: 1452453066
mas "MeetingBar", id: 1532419400
mas "Tomato One", id: 907364780
vscode "atlassian.atlascode"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "solomonkinard.git-blame"
vscode "stylelint.vscode-stylelint"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
