Repository: mperaltad/dotfiles
Catalog: dot_local/share/private_cinnamon/applets/betterlock/po/executable_*.po
Languages: ru

source: Lock Keys
ru: Lock клавиши

source: Num lock on
ru: Num lock включён

source: Num lock off
ru: Num lock выключен

source: Caps lock on
ru: Caps lock включён

source: Caps lock off
ru: Caps lock выключен

source: Show notifications
ru: Показать уведомления

source: Num Lock only
ru: Только Num Lock

source: Caps Lock only
ru: Только Caps Lock

source: Num Lock and Caps Lock
ru: Num Lock и Caps Lock

source: Choose which indicator to show
ru: Выберите индикатор для отображения

source: Shows whether caps lock/num lock is on, and displays a notification when these change.
ru: Апплет показывает включёны ли caps lock или num lock, и отображает уведомление в трее при их переключении.

source: Num Lock/Caps Lock indicator with notifications
ru: Индикатор Num Lock/Caps Lock с уведомлениями в трее
